## Terraform Plan
#### Terraform Format: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
module.gcp_iam.google_service_account.vertex_account: Refreshing state... [id=projects/aitech-good-s17919/serviceAccounts/vertex-account@aitech-good-s17919.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp_iam.google_project_iam_member.vertex_account_user will be created
  + resource "google_project_iam_member" "vertex_account_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:vertex-account@aitech-good-s17919.iam.gserviceaccount.com"
      + project = "aitech-good-S17919"
      + role    = "roles/aiplatform.user"
    }

  # module.gcp_vpc.google_compute_firewall.ml_network_allow_ssh will be created
  + resource "google_compute_firewall" "ml_network_allow_ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "ml-network-allow-ssh"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.gcp_vpc.google_compute_network.ml_network will be created
  + resource "google_compute_network" "ml_network" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "ml-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = "aitech-good-S17919"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.gcp_vpc.google_compute_subnetwork.ml_network_subnet will be created
  + resource "google_compute_subnetwork" "ml_network_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.2.0.0/26"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "ml-network-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>